[Killed] BlockStatement
src/application.ts:6:78
 import { Direction } from './enums';
 
 
-export function handleCommand(command: string, args: string[], robot: Robot) {
-    switch (command) {
-        case 'PLACE':
-            if (args.length === 2 && isValidPlaceCommand(args[1])) {
-                const [x, y, f] = args[1].split(',');
-                const direction = getDirection(f);
-                robot.place(parseInt(x, 10), parseInt(y, 10), <Direction>direction);
-            }
-            break;
-        case 'MOVE':
-            robot.move();
-            break;
-        case 'LEFT':
-            robot.rotateLeft();
-            break;
-        case 'RIGHT':
-            robot.rotateRight();
-            break;
-        case 'REPORT':
-            robot.report();
-            break;
-        default:
-            console.log('Invalid command.');
-    }
-}
+export function handleCommand(command: string, args: string[], robot: Robot) {}
 
killedBy: handleCommand places the robot correctly when PLACE command is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, 2, 0

Number of calls: 0

[Killed] ConditionalExpression
src/application.ts:8:9
 
 export function handleCommand(command: string, args: string[], robot: Robot) {
     switch (command) {
-        case 'PLACE':
-            if (args.length === 2 && isValidPlaceCommand(args[1])) {
-                const [x, y, f] = args[1].split(',');
-                const direction = getDirection(f);
-                robot.place(parseInt(x, 10), parseInt(y, 10), <Direction>direction);
-            }
-            break;
+        case 'PLACE':
         case 'MOVE':
             robot.move();
killedBy: handleCommand places the robot correctly when PLACE command is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, 2, 0

Number of calls: 0

[Killed] ConditionalExpression
src/application.ts:9:17
 export function handleCommand(command: string, args: string[], robot: Robot) {
     switch (command) {
         case 'PLACE':
-            if (args.length === 2 && isValidPlaceCommand(args[1])) {
+            if (true) {
                 const [x, y, f] = args[1].split(',');
                 const direction = getDirection(f);
killedBy: handleCommand does not place the robot when PLACE command is invalid
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: NaN, NaN, undefined

[Killed] LogicalOperator
src/application.ts:9:17
 export function handleCommand(command: string, args: string[], robot: Robot) {
     switch (command) {
         case 'PLACE':
-            if (args.length === 2 && isValidPlaceCommand(args[1])) {
+            if (args.length === 2 || isValidPlaceCommand(args[1])) {
                 const [x, y, f] = args[1].split(',');
                 const direction = getDirection(f);
killedBy: handleCommand does not place the robot when PLACE command is invalid
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: NaN, NaN, undefined

[Killed] ConditionalExpression
src/application.ts:15:9
                 robot.place(parseInt(x, 10), parseInt(y, 10), <Direction>direction);
             }
             break;
-        case 'MOVE':
-            robot.move();
-            break;
+        case 'MOVE':
         case 'LEFT':
             robot.rotateLeft();
killedBy: handleCommand moves the robot when MOVE command is issued
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/application.ts:15:14
                 robot.place(parseInt(x, 10), parseInt(y, 10), <Direction>direction);
             }
             break;
-        case 'MOVE':
+        case "":
             robot.move();
             break;
killedBy: handleCommand moves the robot when MOVE command is issued
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/application.ts:18:9
         case 'MOVE':
             robot.move();
             break;
-        case 'LEFT':
-            robot.rotateLeft();
-            break;
+        case 'LEFT':
         case 'RIGHT':
             robot.rotateRight();
killedBy: handleCommand rotates the robot left when LEFT command is issued
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/application.ts:18:14
         case 'MOVE':
             robot.move();
             break;
-        case 'LEFT':
+        case "":
             robot.rotateLeft();
             break;
killedBy: handleCommand rotates the robot left when LEFT command is issued
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/application.ts:21:9
         case 'LEFT':
             robot.rotateLeft();
             break;
-        case 'RIGHT':
-            robot.rotateRight();
-            break;
+        case 'RIGHT':
         case 'REPORT':
             robot.report();
killedBy: handleCommand rotates the robot right when RIGHT command is issued
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/application.ts:24:9
         case 'RIGHT':
             robot.rotateRight();
             break;
-        case 'REPORT':
-            robot.report();
-            break;
+        case 'REPORT':
         default:
             console.log('Invalid command.');
killedBy: handleCommand reports the robot position when REPORT command is issued
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/application.ts:27:9
         case 'REPORT':
             robot.report();
             break;
-        default:
-            console.log('Invalid command.');
+        default:
     }
 }
