[Killed] BlockStatement
src/helpers.ts:17:60
  * @param args - The command string to validate.
  * @returns true if the command string is valid, false otherwise.
  */
-export function isValidPlaceCommand(args: string): boolean {
-    const parts = args.split(',');
-    if (parts.length !== 3) return false;
-
-    const x = Number(parts[0]);
-    const y = Number(parts[1]);
-
-    // If either part is not a number, or if they are not integers, or if they are not within the grid size of the Robot, the command string is invalid
-    if (isNaN(x) || isNaN(y) || !Number.isInteger(x) || !Number.isInteger(y) || x < 0 || x >= Robot.gridSize || y < 0 || y >= Robot.gridSize) return false;
-
-    // The third part of the command string must be a valid direction in the Direction enum
-    const f = parts[2].toUpperCase();
-    const validDirections = Object.keys(Direction).filter(k => isNaN(Number(k)));
-    if (!validDirections.includes(f)) return false;
-
-    return true;
-}
+export function isValidPlaceCommand(args: string): boolean {}
 
 /**
killedBy: handleCommand places the robot correctly when PLACE command is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, 2, 0

Number of calls: 0

[Killed] StringLiteral
src/helpers.ts:18:30
  * @returns true if the command string is valid, false otherwise.
  */
 export function isValidPlaceCommand(args: string): boolean {
-    const parts = args.split(',');
+    const parts = args.split("");
     if (parts.length !== 3) return false;
 
killedBy: handleCommand places the robot correctly when PLACE command is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, 2, 0

Number of calls: 0

[Killed] EqualityOperator
src/helpers.ts:19:9
  */
 export function isValidPlaceCommand(args: string): boolean {
     const parts = args.split(',');
-    if (parts.length !== 3) return false;
+    if (parts.length === 3) return false;
 
     const x = Number(parts[0]);
killedBy: isValidPlaceCommand isValidPlaceCommand("0,0,NORTH") should return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/helpers.ts:19:36
  */
 export function isValidPlaceCommand(args: string): boolean {
     const parts = args.split(',');
-    if (parts.length !== 3) return false;
+    if (parts.length !== 3) return true;
 
     const x = Number(parts[0]);
killedBy: handleCommand does not place the robot when PLACE command is invalid
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: NaN, NaN, undefined

[Killed] EqualityOperator
src/helpers.ts:25:113
     const y = Number(parts[1]);
 
     // If either part is not a number, or if they are not integers, or if they are not within the grid size of the Robot, the command string is invalid
-    if (isNaN(x) || isNaN(y) || !Number.isInteger(x) || !Number.isInteger(y) || x < 0 || x >= Robot.gridSize || y < 0 || y >= Robot.gridSize) return false;
+    if (isNaN(x) || isNaN(y) || !Number.isInteger(x) || !Number.isInteger(y) || x < 0 || x >= Robot.gridSize || y <= 0 || y >= Robot.gridSize) return false;
 
     // The third part of the command string must be a valid direction in the Direction enum
killedBy: isValidPlaceCommand isValidPlaceCommand("0,0,NORTH") should return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/helpers.ts:25:9
     const y = Number(parts[1]);
 
     // If either part is not a number, or if they are not integers, or if they are not within the grid size of the Robot, the command string is invalid
-    if (isNaN(x) || isNaN(y) || !Number.isInteger(x) || !Number.isInteger(y) || x < 0 || x >= Robot.gridSize || y < 0 || y >= Robot.gridSize) return false;
+    if ((isNaN(x) || isNaN(y) || !Number.isInteger(x) || !Number.isInteger(y) || x < 0 || x >= Robot.gridSize || y < 0) && y >= Robot.gridSize) return false;
 
     // The third part of the command string must be a valid direction in the Direction enum
killedBy: isValidPlaceCommand Boundary and Invalid Inputs isValidPlaceCommand("-1,0,EAST") should return false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/helpers.ts:28:15
     if (isNaN(x) || isNaN(y) || !Number.isInteger(x) || !Number.isInteger(y) || x < 0 || x >= Robot.gridSize || y < 0 || y >= Robot.gridSize) return false;
 
     // The third part of the command string must be a valid direction in the Direction enum
-    const f = parts[2].toUpperCase();
+    const f = parts[2].toLowerCase();
     const validDirections = Object.keys(Direction).filter(k => isNaN(Number(k)));
     if (!validDirections.includes(f)) return false;
killedBy: handleCommand places the robot correctly when PLACE command is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, 2, 0

Number of calls: 0

[Killed] ArrowFunction
src/helpers.ts:29:59
 
     // The third part of the command string must be a valid direction in the Direction enum
     const f = parts[2].toUpperCase();
-    const validDirections = Object.keys(Direction).filter(k => isNaN(Number(k)));
+    const validDirections = Object.keys(Direction).filter(() => undefined);
     if (!validDirections.includes(f)) return false;
 
killedBy: isValidPlaceCommand isValidPlaceCommand("0,0,NORTH") should return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
src/helpers.ts:29:29
 
     // The third part of the command string must be a valid direction in the Direction enum
     const f = parts[2].toUpperCase();
-    const validDirections = Object.keys(Direction).filter(k => isNaN(Number(k)));
+    const validDirections = Object.keys(Direction);
     if (!validDirections.includes(f)) return false;
 

[Killed] BooleanLiteral
src/helpers.ts:30:9
     // The third part of the command string must be a valid direction in the Direction enum
     const f = parts[2].toUpperCase();
     const validDirections = Object.keys(Direction).filter(k => isNaN(Number(k)));
-    if (!validDirections.includes(f)) return false;
+    if (validDirections.includes(f)) return false;
 
     return true;
killedBy: isValidPlaceCommand isValidPlaceCommand("0,0,NORTH") should return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/helpers.ts:30:9
     // The third part of the command string must be a valid direction in the Direction enum
     const f = parts[2].toUpperCase();
     const validDirections = Object.keys(Direction).filter(k => isNaN(Number(k)));
-    if (!validDirections.includes(f)) return false;
+    if (true) return false;
 
     return true;
killedBy: isValidPlaceCommand isValidPlaceCommand("0,0,NORTH") should return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/helpers.ts:41:91
  * @param direction - The string to convert to a Direction enum value.
  * @returns The Direction enum value that corresponds to the provided string.
  */
-export function getDirection(direction: string | null | undefined): Direction | undefined {
-    if (!direction) return undefined;
-    if (!isNaN(Number(direction))) return undefined;
-
-    return (Direction as any)[direction.toUpperCase()];
-}
+export function getDirection(direction: string | null | undefined): Direction | undefined {}
 
killedBy: getDirection getDirection("NORTH") should return 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/helpers.ts:42:9
  * @returns The Direction enum value that corresponds to the provided string.
  */
 export function getDirection(direction: string | null | undefined): Direction | undefined {
-    if (!direction) return undefined;
+    if (true) return undefined;
     if (!isNaN(Number(direction))) return undefined;
 
killedBy: getDirection getDirection("NORTH") should return 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/helpers.ts:42:9
  * @returns The Direction enum value that corresponds to the provided string.
  */
 export function getDirection(direction: string | null | undefined): Direction | undefined {
-    if (!direction) return undefined;
+    if (false) return undefined;
     if (!isNaN(Number(direction))) return undefined;
 
killedBy: getDirection getDirection("undefined") should return undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'toUpperCase')

[Killed] BooleanLiteral
src/helpers.ts:43:9
  */
 export function getDirection(direction: string | null | undefined): Direction | undefined {
     if (!direction) return undefined;
-    if (!isNaN(Number(direction))) return undefined;
+    if (isNaN(Number(direction))) return undefined;
 
     return (Direction as any)[direction.toUpperCase()];
killedBy: getDirection getDirection("NORTH") should return 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/helpers.ts:43:9
  */
 export function getDirection(direction: string | null | undefined): Direction | undefined {
     if (!direction) return undefined;
-    if (!isNaN(Number(direction))) return undefined;
+    if (false) return undefined;
 
     return (Direction as any)[direction.toUpperCase()];
killedBy: getDirection Edge Cases getDirection("0") should return undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: "NORTH"

[Killed] MethodExpression
src/helpers.ts:45:31
     if (!direction) return undefined;
     if (!isNaN(Number(direction))) return undefined;
 
-    return (Direction as any)[direction.toUpperCase()];
+    return (Direction as any)[direction.toLowerCase()];
 }
 
killedBy: getDirection getDirection("NORTH") should return 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined
