[Survived] BlockStatement
src/index.ts:18:26
 
 let robot: Robot = new Robot();
 
-rl.on('line', (input) => {
-    if (input.trim().toUpperCase() === 'EXIT') {
-        console.log('Goodbye!');
-        rl.close();
-        return;
-    }
-
-    const args: string[] = input.split(' ');
-    const command: string = args[0].toUpperCase();
-
-    if (!robot.isPlaced() && command !== 'PLACE') {
-        console.log('Robot is not placed yet. Please use the PLACE command to place the robot on the grid.');
-        rl.prompt();
-        return;
-    }
-
-    handleCommand(command, args, robot);
-
-    rl.prompt();
-}).on('close', () => {
+rl.on('line', (input) => {}).on('close', () => {
     process.exit(0);
 });

[Survived] MethodExpression
src/index.ts:19:9
 let robot: Robot = new Robot();
 
 rl.on('line', (input) => {
-    if (input.trim().toUpperCase() === 'EXIT') {
+    if (input.toUpperCase() === 'EXIT') {
         console.log('Goodbye!');
         rl.close();

[Survived] ConditionalExpression
src/index.ts:19:9
 let robot: Robot = new Robot();
 
 rl.on('line', (input) => {
-    if (input.trim().toUpperCase() === 'EXIT') {
+    if (true) {
         console.log('Goodbye!');
         rl.close();

[Survived] MethodExpression
src/index.ts:26:29
     }
 
     const args: string[] = input.split(' ');
-    const command: string = args[0].toUpperCase();
+    const command: string = args[0].toLowerCase();
 
     if (!robot.isPlaced() && command !== 'PLACE') {

[Survived] BooleanLiteral
src/index.ts:28:9
     const args: string[] = input.split(' ');
     const command: string = args[0].toUpperCase();
 
-    if (!robot.isPlaced() && command !== 'PLACE') {
+    if (robot.isPlaced() && command !== 'PLACE') {
         console.log('Robot is not placed yet. Please use the PLACE command to place the robot on the grid.');
         rl.prompt();

[Survived] BlockStatement
src/index.ts:28:51
     const args: string[] = input.split(' ');
     const command: string = args[0].toUpperCase();
 
-    if (!robot.isPlaced() && command !== 'PLACE') {
-        console.log('Robot is not placed yet. Please use the PLACE command to place the robot on the grid.');
-        rl.prompt();
-        return;
-    }
+    if (!robot.isPlaced() && command !== 'PLACE') {}
 
     handleCommand(command, args, robot);

[Survived] BlockStatement
src/index.ts:37:22
     handleCommand(command, args, robot);
 
     rl.prompt();
-}).on('close', () => {
-    process.exit(0);
-});
+}).on('close', () => {});
 
