[Killed] UnaryOperator
src/robot.ts:17:17
  * 0,0  1,0  2,0  3,0  4,0
  */
 export class Robot {
-    x: number = -1;
+    x: number = +1;
     y: number = -1;
     f: Direction = Direction.EAST;
killedBy: Robot place should not place the robot at an invalid position
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: 1

[Killed] UnaryOperator
src/robot.ts:18:17
  */
 export class Robot {
     x: number = -1;
-    y: number = -1;
+    y: number = +1;
     f: Direction = Direction.EAST;
     static gridSize: number = 5;
killedBy: Robot place should not place the robot at an invalid position
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: 1

[Killed] BlockStatement
src/robot.ts:23:53
     static gridSize: number = 5;
 
 
-    place(x: number, y: number, f: Direction): void {
-        if (!this.validPosition(x, y)) return;
-
-        this.x = x;
-        this.y = y;
-        this.f = f;
-    }
+    place(x: number, y: number, f: Direction): void {}
 
     move(): void {
killedBy: Robot place should place the robot at a valid position
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
src/robot.ts:24:13
 
 
     place(x: number, y: number, f: Direction): void {
-        if (!this.validPosition(x, y)) return;
+        if (true) return;
 
         this.x = x;
killedBy: Robot place should place the robot at a valid position
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] BooleanLiteral
src/robot.ts:24:13
 
 
     place(x: number, y: number, f: Direction): void {
-        if (!this.validPosition(x, y)) return;
+        if (this.validPosition(x, y)) return;
 
         this.x = x;
killedBy: Robot place should place the robot at a valid position
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/robot.ts:31:18
         this.f = f;
     }
 
-    move(): void {
-        let newX: number = this.x;
-        let newY: number = this.y;
-
-        switch (this.f) {
-            case Direction.NORTH:
-                newY += 1;
-                break;
-            case Direction.SOUTH:
-                newY -= 1;
-                break;
-            case Direction.EAST:
-                newX += 1;
-                break;
-            case Direction.WEST:
-                newX -= 1;
-                break;
-        }
-
-        if (!this.validPosition(newX, newY)) return;
-
-        this.x = newX;
-        this.y = newY;
-    }
+    move(): void {}
 
     rotateLeft(): void {
killedBy: Robot move should move the robot one step to the north when facing north
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
src/robot.ts:36:13
         let newY: number = this.y;
 
         switch (this.f) {
-            case Direction.NORTH:
-                newY += 1;
-                break;
+            case Direction.NORTH:
             case Direction.SOUTH:
                 newY -= 1;
killedBy: Robot move should move the robot one step to the north when facing north
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] AssignmentOperator
src/robot.ts:37:17
 
         switch (this.f) {
             case Direction.NORTH:
-                newY += 1;
+                newY -= 1;
                 break;
             case Direction.SOUTH:
killedBy: Robot move should move the robot one step to the north when facing north
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/robot.ts:39:13
             case Direction.NORTH:
                 newY += 1;
                 break;
-            case Direction.SOUTH:
-                newY -= 1;
-                break;
+            case Direction.SOUTH:
             case Direction.EAST:
                 newX += 1;
killedBy: Robot move should move the robot one step to the south when facing south
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] AssignmentOperator
src/robot.ts:40:17
                 newY += 1;
                 break;
             case Direction.SOUTH:
-                newY -= 1;
+                newY += 1;
                 break;
             case Direction.EAST:
killedBy: Robot move should move the robot one step to the south when facing south
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 2

[Killed] ConditionalExpression
src/robot.ts:42:13
             case Direction.SOUTH:
                 newY -= 1;
                 break;
-            case Direction.EAST:
-                newX += 1;
-                break;
+            case Direction.EAST:
             case Direction.WEST:
                 newX -= 1;
killedBy: Robot move should move the robot one step to the east when facing east
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] AssignmentOperator
src/robot.ts:43:17
                 newY -= 1;
                 break;
             case Direction.EAST:
-                newX += 1;
+                newX -= 1;
                 break;
             case Direction.WEST:
killedBy: Robot move should move the robot one step to the east when facing east
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/robot.ts:45:13
             case Direction.EAST:
                 newX += 1;
                 break;
-            case Direction.WEST:
-                newX -= 1;
-                break;
+            case Direction.WEST:
         }
 
killedBy: Robot move should move the robot one step to the west when facing west
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] AssignmentOperator
src/robot.ts:46:17
                 newX += 1;
                 break;
             case Direction.WEST:
-                newX -= 1;
+                newX += 1;
                 break;
         }
killedBy: Robot move should move the robot one step to the west when facing west
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 2

[Killed] BooleanLiteral
src/robot.ts:50:13
                 break;
         }
 
-        if (!this.validPosition(newX, newY)) return;
+        if (this.validPosition(newX, newY)) return;
 
         this.x = newX;
killedBy: Robot move should move the robot one step to the north when facing north
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
src/robot.ts:50:13
                 break;
         }
 
-        if (!this.validPosition(newX, newY)) return;
+        if (false) return;
 
         this.x = newX;
killedBy: Robot move should not move the robot if it is at the edge and facing the edge
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] BlockStatement
src/robot.ts:56:24
         this.y = newY;
     }
 
-    rotateLeft(): void {
-        this.f = (this.f + 3) % 4;
-    }
+    rotateLeft(): void {}
 
     rotateRight(): void {
killedBy: Robot Robot rotateLeft should rotate the robot 90 degrees to the left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 0

[Killed] ArithmeticOperator
src/robot.ts:57:19
     }
 
     rotateLeft(): void {
-        this.f = (this.f + 3) % 4;
+        this.f = (this.f - 3) % 4;
     }
 
killedBy: Robot Robot rotateLeft should rotate the robot 90 degrees to the left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: -3

[Killed] ArithmeticOperator
src/robot.ts:57:18
     }
 
     rotateLeft(): void {
-        this.f = (this.f + 3) % 4;
+        this.f = (this.f + 3) * 4;
     }
 
killedBy: Robot Robot rotateLeft should rotate the robot 90 degrees to the left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 12

[Killed] BlockStatement
src/robot.ts:60:25
         this.f = (this.f + 3) % 4;
     }
 
-    rotateRight(): void {
-        this.f = (this.f + 1) % 4;
-    }
+    rotateRight(): void {}
 
     report(): void {
killedBy: Robot Robot rotateRight should rotate the robot 90 degrees to the right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
src/robot.ts:61:18
     }
 
     rotateRight(): void {
-        this.f = (this.f + 1) % 4;
+        this.f = (this.f + 1) * 4;
     }
 
killedBy: Robot Robot rotateRight should rotate the robot 90 degrees to the right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 4

[Killed] ArithmeticOperator
src/robot.ts:61:19
     }
 
     rotateRight(): void {
-        this.f = (this.f + 1) % 4;
+        this.f = (this.f - 1) % 4;
     }
 
killedBy: Robot Robot rotateRight should rotate the robot 90 degrees to the right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/robot.ts:64:20
         this.f = (this.f + 1) % 4;
     }
 
-    report(): void {
-        console.log(`${this.x},${this.y},${Direction[this.f]}`);
-    }
+    report(): void {}
 
     isPlaced(): boolean {
killedBy: Robot Robot report should report the current position and direction of the robot
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1,1,NORTH"

Number of calls: 0

[Killed] BlockStatement
src/robot.ts:68:25
         console.log(`${this.x},${this.y},${Direction[this.f]}`);
     }
 
-    isPlaced(): boolean {
-        return this.x !== -1 && this.y !== -1;
-    }
+    isPlaced(): boolean {}
 
     private validPosition(x: number, y: number): boolean {
killedBy: Robot Robot isPlaced should return true if the robot is placed on the grid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] UnaryOperator
src/robot.ts:69:27
     }
 
     isPlaced(): boolean {
-        return this.x !== -1 && this.y !== -1;
+        return this.x !== +1 && this.y !== -1;
     }
 
killedBy: Robot Robot isPlaced should return true if the robot is placed on the grid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/robot.ts:69:16
     }
 
     isPlaced(): boolean {
-        return this.x !== -1 && this.y !== -1;
+        return false;
     }
 
killedBy: Robot Robot isPlaced should return true if the robot is placed on the grid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
src/robot.ts:72:58
         return this.x !== -1 && this.y !== -1;
     }
 
-    private validPosition(x: number, y: number): boolean {
-        return x >= 0 && x < Robot.gridSize && y >= 0 && y < Robot.gridSize;
-    }
+    private validPosition(x: number, y: number): boolean {}
 }
 
killedBy: Robot place should place the robot at a valid position
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] EqualityOperator
src/robot.ts:73:58
     }
 
     private validPosition(x: number, y: number): boolean {
-        return x >= 0 && x < Robot.gridSize && y >= 0 && y < Robot.gridSize;
+        return x >= 0 && x < Robot.gridSize && y >= 0 && y >= Robot.gridSize;
     }
 }
killedBy: Robot place should place the robot at a valid position
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] LogicalOperator
src/robot.ts:73:16
     }
 
     private validPosition(x: number, y: number): boolean {
-        return x >= 0 && x < Robot.gridSize && y >= 0 && y < Robot.gridSize;
+        return x >= 0 && x < Robot.gridSize && y >= 0 || y < Robot.gridSize;
     }
 }
killedBy: Robot move should not move the robot if it is at the edge and facing the edge
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1
